/*
1. Создать пользовательский тип данных (class) для представления заказа (Order), содержащего наименование товара (тип string),
   номер телефона заказчика (тип long), стоимость (тип float), адрес доставки (тип string)
2. Создать и инциализировать массив из трех объектов класса Order, и вывести в цикле на экран полную информацию о всех заказах в массиве
*/


Console.WriteLine("Hello, World!");